In [1]:
import pandas as pd
import numpy as np

team_file = "~/src/baseball-lahman/baseballdatabank-master/core/teams.csv"

tf = pd.read_csv(team_file)
tf

,yearID,lgID,teamID,franchID,divID,Rank,G,Ghome,W,L,...,DP,FP,name,park,attendance,BPF,PPF,teamIDBR,teamIDlahman45,teamIDretro
0,1871,NaN,BS1,BNA,NaN,3,31,NaN,20,10,...,24,0.834,Boston Red Stockings,South End Grounds I,NaN,103,98,BOS,BS1,BS1
1,1871,NaN,CH1,CNA,NaN,2,28,NaN,19,9,...,16,0.829,Chicago White Stockings,Union Base-Ball Grounds,NaN,104,102,CHI,CH1,CH1
2,1871,NaN,CL1,CFC,NaN,8,29,NaN,10,19,...,15,0.818,Cleveland Forest Citys,National Association Grounds,NaN,96,100,CLE,CL1,CL1
3,1871,NaN,FW1,KEK,NaN,7,19,NaN,7,12,...,8,0.803,Fort Wayne Kekiongas,Hamilton Field,NaN,101,107,KEK,FW1,FW1
4,1871,NaN,NY2,NNA,NaN,5,33,NaN,16,17,...,14,0.840,New York Mutuals,Union Grounds (Brooklyn),NaN,90,88,NYU,NY2,NY2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2920,2019,NL,SLN,STL,C,1,162,81.0,91,71,...,168,0.989,St. Louis Cardinals,Busch Stadium III,3480393.0,98,97,STL,SLN,SLN
2921,2019,AL,TBA,TBD,E,2,162,81.0,96,66,...,126,0.985,Tampa Bay Rays,Tropicana Field,1178735.0,97,96,TBR,TBA,TBA
2922,2019,AL,TEX,TEX,W,3,162,81.0,78,84,...,143,0.982,Texas Rangers,Globe Life Park in Arlington,2132994.0,111,112,TEX,TEX,TEX
2923,2019,AL,TOR,TOR,E,4,162,81.0,67,95,...,141,0.984,Toronto Blue Jays,Rogers Centre,1750114.0,97,98,TOR,TOR,TOR
2924,2019,NL,WAS,WSN,E,2,162,81.0,93,69,...,111,0.985,Washington Nationals,Nationals Park,2259781.0,106,104,WSN,MON,WAS

In [2]:
tf.yearID

0       1871
1       1871
2       1871
3       1871
4       1871
        ...
2920    2019
2921    2019
2922    2019
2923    2019
2924    2019
Name: yearID, Length: 2925, dtype: int64

In [3]:
tf['yearID']

0       1871
1       1871
2       1871
3       1871
4       1871
        ...
2920    2019
2921    2019
2922    2019
2923    2019
2924    2019
Name: yearID, Length: 2925, dtype: int64

In [4]:
tf70 = tf[tf['yearID'] >= 1970]
tf70

,yearID,lgID,teamID,franchID,divID,Rank,G,Ghome,W,L,...,DP,FP,name,park,attendance,BPF,PPF,teamIDBR,teamIDlahman45,teamIDretro
1541,1970,NL,ATL,ATL,W,5,162,81.0,76,86,...,118,0.977,Atlanta Braves,Atlanta-Fulton County Stadium,1078848.0,106,106,ATL,ATL,ATL
1542,1970,AL,BAL,BAL,E,1,162,81.0,108,54,...,148,0.981,Baltimore Orioles,Memorial Stadium,1057069.0,101,98,BAL,BAL,BAL
1543,1970,AL,BOS,BOS,E,3,162,81.0,87,75,...,131,0.974,Boston Red Sox,Fenway Park II,1595278.0,108,107,BOS,BOS,BOS
1544,1970,AL,CAL,ANA,W,3,162,81.0,86,76,...,169,0.980,California Angels,Anaheim Stadium,1077741.0,96,97,CAL,CAL,CAL
1545,1970,AL,CHA,CHW,W,6,162,84.0,56,106,...,187,0.975,Chicago White Sox,Comiskey Park,495355.0,101,102,CHW,CHA,CHA
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2920,2019,NL,SLN,STL,C,1,162,81.0,91,71,...,168,0.989,St. Louis Cardinals,Busch Stadium III,3480393.0,98,97,STL,SLN,SLN
2921,2019,AL,TBA,TBD,E,2,162,81.0,96,66,...,126,0.985,Tampa Bay Rays,Tropicana Field,1178735.0,97,96,TBR,TBA,TBA
2922,2019,AL,TEX,TEX,W,3,162,81.0,78,84,...,143,0.982,Texas Rangers,Globe Life Park in Arlington,2132994.0,111,112,TEX,TEX,TEX
2923,2019,AL,TOR,TOR,E,4,162,81.0,67,95,...,141,0.984,Toronto Blue Jays,Rogers Centre,1750114.0,97,98,TOR,TOR,TOR
2924,2019,NL,WAS,WSN,E,2,162,81.0,93,69,...,111,0.985,Washington Nationals,Nationals Park,2259781.0,106,104,WSN,MON,WAS

In [5]:
# using iloc to subset rows and columns using numbers
tf70.iloc[[2,3,4], [0,1,2,3,4,5,8,9]]

      yearID lgID teamID franchID divID  Rank   W    L
1543    1970   AL    BOS      BOS     E     3  87   75
1544    1970   AL    CAL      ANA     W     3  86   76
1545    1970   AL    CHA      CHW     W     6  56  106

In [6]:
# slicing rows
tf70[:5]

,yearID,lgID,teamID,franchID,divID,Rank,G,Ghome,W,L,...,DP,FP,name,park,attendance,BPF,PPF,teamIDBR,teamIDlahman45,teamIDretro
1541,1970,NL,ATL,ATL,W,5,162,81.0,76,86,...,118,0.977,Atlanta Braves,Atlanta-Fulton County Stadium,1078848.0,106,106,ATL,ATL,ATL
1542,1970,AL,BAL,BAL,E,1,162,81.0,108,54,...,148,0.981,Baltimore Orioles,Memorial Stadium,1057069.0,101,98,BAL,BAL,BAL
1543,1970,AL,BOS,BOS,E,3,162,81.0,87,75,...,131,0.974,Boston Red Sox,Fenway Park II,1595278.0,108,107,BOS,BOS,BOS
1544,1970,AL,CAL,ANA,W,3,162,81.0,86,76,...,169,0.980,California Angels,Anaheim Stadium,1077741.0,96,97,CAL,CAL,CAL
1545,1970,AL,CHA,CHW,W,6,162,84.0,56,106,...,187,0.975,Chicago White Sox,Comiskey Park,495355.0,101,102,CHW,CHA,CHA

In [7]:
# columns by name
tf70[['yearID', 'name', 'W', 'L']]

      yearID                  name    W    L
1541    1970        Atlanta Braves   76   86
1542    1970     Baltimore Orioles  108   54
1543    1970        Boston Red Sox   87   75
1544    1970     California Angels   86   76
1545    1970     Chicago White Sox   56  106
...      ...                   ...  ...  ...
2920    2019   St. Louis Cardinals   91   71
2921    2019        Tampa Bay Rays   96   66
2922    2019         Texas Rangers   78   84
2923    2019     Toronto Blue Jays   67   95
2924    2019  Washington Nationals   93   69

[1384 rows x 4 columns]

In [8]:
# slicing with a boolean array
tf70[tf70['W'] >= 90]

,yearID,lgID,teamID,franchID,divID,Rank,G,Ghome,W,L,...,DP,FP,name,park,attendance,BPF,PPF,teamIDBR,teamIDlahman45,teamIDretro
1542,1970,AL,BAL,BAL,E,1,162,81.0,108,54,...,148,0.981,Baltimore Orioles,Memorial Stadium,1057069.0,101,98,BAL,BAL,BAL
1547,1970,NL,CIN,CIN,W,1,162,81.0,102,60,...,173,0.976,Cincinnati Reds,Crosley Field/Riverfront Stadium,1803568.0,104,103,CIN,CIN,CIN
1553,1970,AL,MIN,MIN,W,1,162,81.0,98,64,...,130,0.980,Minnesota Twins,Metropolitan Stadium,1261887.0,103,102,MIN,MIN,MIN
1556,1970,AL,NYA,NYY,E,2,163,81.0,93,69,...,146,0.980,New York Yankees,Yankee Stadium I,1136879.0,95,95,NYY,NYA,NYA
1566,1971,AL,BAL,BAL,E,1,158,77.0,101,57,...,148,0.981,Baltimore Orioles,Memorial Stadium,1023037.0,99,97,BAL,BAL,BAL
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2912,2019,AL,NYA,NYY,E,1,162,81.0,103,59,...,135,0.982,New York Yankees,Yankee Stadium III,3304404.0,98,96,NYY,NYA,NYA
2914,2019,AL,OAK,OAK,W,2,162,81.0,97,65,...,122,0.987,Oakland Athletics,O.co Coliseum,1662211.0,95,93,OAK,OAK,OAK
2920,2019,NL,SLN,STL,C,1,162,81.0,91,71,...,168,0.989,St. Louis Cardinals,Busch Stadium III,3480393.0,98,97,STL,SLN,SLN
2921,2019,AL,TBA,TBD,E,2,162,81.0,96,66,...,126,0.985,Tampa Bay Rays,Tropicana Field,1178735.0,97,96,TBR,TBA,TBA
2924,2019,NL,WAS,WSN,E,2,162,81.0,93,69,...,111,0.985,Washington Nationals,Nationals Park,2259781.0,106,104,WSN,MON,WAS

In [9]:
# all rows, select columns
tf70.loc[:, ['yearID', 'teamID', 'W', 'L']]

      yearID teamID    W    L
1541    1970    ATL   76   86
1542    1970    BAL  108   54
1543    1970    BOS   87   75
1544    1970    CAL   86   76
1545    1970    CHA   56  106
...      ...    ...  ...  ...
2920    2019    SLN   91   71
2921    2019    TBA   96   66
2922    2019    TEX   78   84
2923    2019    TOR   67   95
2924    2019    WAS   93   69

[1384 rows x 4 columns]

In [10]:
tf70.loc[1543, ['yearID', 'teamID', 'W', 'L']]

yearID    1970
teamID     BOS
W           87
L           75
Name: 1543, dtype: object

In [11]:
tf70.loc[[1543, 1544, 1545], ['yearID', 'teamID', 'W', 'L']]

      yearID teamID   W    L
1543    1970    BOS  87   75
1544    1970    CAL  86   76
1545    1970    CHA  56  106

In [12]:
# arithmetic between data frame and series
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah','Ohio','Texas','Oregon'])

In [13]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [14]:
series = frame.iloc[0]

In [15]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [16]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [17]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [18]:
series2

b    0
e    1
f    2
dtype: int64

In [19]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [20]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [21]:
# broadcast the operation over the columns, use the methods
series3 = frame['d']

In [22]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [23]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [27]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [28]:
#Numpy's ufuncs work in pandas
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [29]:
frame

               b         d         e
Utah    1.157774 -0.955768  1.004840
Ohio   -0.668984  0.180102 -0.959998
Texas  -1.459897  0.848699  0.461276
Oregon -1.032346 -0.488739 -1.983047

In [30]:
np.abs(frame)

               b         d         e
Utah    1.157774  0.955768  1.004840
Ohio    0.668984  0.180102  0.959998
Texas   1.459897  0.848699  0.461276
Oregon  1.032346  0.488739  1.983047

In [31]:
# apply a function on one dimensional arrays to each column
f = lambda x: x.max() - x.min()

In [32]:
frame

               b         d         e
Utah    1.157774 -0.955768  1.004840
Ohio   -0.668984  0.180102 -0.959998
Texas  -1.459897  0.848699  0.461276
Oregon -1.032346 -0.488739 -1.983047

In [33]:
frame.apply(f)

b    2.617671
d    1.804467
e    2.987887
dtype: float64

In [34]:
# pass axis='columns' applies the function to each row
frame.apply(f, axis='columns')

Utah      2.113542
Ohio      1.140100
Texas     2.308596
Oregon    1.494308
dtype: float64

In [35]:
# the apply function can return a Series of values
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [36]:
frame.apply(f)

            b         d         e
min -1.459897 -0.955768 -1.983047
max  1.157774  0.848699  1.004840

In [37]:
# sorting values in a frame
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [38]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [39]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [40]:
# ranking a DataFrame
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})

In [41]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [42]:
# default tie-break is arithmetic mean
# rank for each column
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [43]:
# rank each row
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [44]:
# duplicate indices (axis labels)
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [45]:
df

          0         1         2
a -2.843520 -1.186693  0.623608
a  0.389829 -0.716992  0.468603
b -0.256797  1.281038 -0.240678
b  0.916867  1.876483 -0.173454

In [46]:
df.loc['b']

          0         1         2
b -0.256797  1.281038 -0.240678
b  0.916867  1.876483 -0.173454

In [47]:
# summary stats functions
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [48]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [49]:
# compute column sums
df.sum()

one    9.25
two   -5.80
dtype: float64

In [50]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [51]:
# NA values are excluded unless the whole row or column is NA
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [52]:
# consider NA's
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [53]:
# an example reading stock data
import pandas_datareader.data as web

In [62]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [63]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})

In [64]:
price

                  AAPL         IBM        MSFT         GOOG
Date
2015-11-23   27.051517  110.319260   49.450100   755.979980
2015-11-24   27.311123  110.430771   49.504841   748.280029
2015-11-25   27.115845  109.952744   48.993832   748.150024
2015-11-27   27.065306  110.319260   49.212845   750.260010
2015-11-30   27.177872  111.084122   49.596100   742.599976
...                ...         ...         ...          ...
2020-11-16  120.300003  118.360001  216.662766  1781.380005
2020-11-17  119.389999  117.699997  213.900009  1770.150024
2020-11-18  118.029999  116.769997  211.080002  1746.780029
2020-11-19  118.639999  117.180000  212.419998  1763.920044
2020-11-20  117.339996  116.940002  210.389999  1742.189941

[1259 rows x 4 columns]

In [65]:
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [66]:
volume

                   AAPL        IBM        MSFT     GOOG
Date
2015-11-23  129930000.0  5137900.0  28235900.0  1414500
2015-11-24  171212800.0  3407700.0  24600000.0  2333100
2015-11-25   85553200.0  3238200.0  21005100.0  1122100
2015-11-27   52185600.0  1415800.0   9009100.0   838500
2015-11-30  156721200.0  4545600.0  56241400.0  2097600
...                 ...        ...         ...      ...
2020-11-16   91183000.0  5293400.0  24953300.0  1246800
2020-11-17   74271000.0  4134500.0  24154100.0  1147100
2020-11-18   76322100.0  4606800.0  28372800.0  1173500
2020-11-19   74113000.0  3439600.0  24792700.0  1249900
2020-11-20   73391400.0  5024300.0  22829100.0  2313500

[1259 rows x 4 columns]

In [68]:
# compute percent changes in prices - a time series operation
returns = price.pct_change()

In [69]:
returns.tail()

                AAPL       IBM      MSFT      GOOG
Date
2020-11-16  0.008720  0.012923  0.003326  0.002454
2020-11-17 -0.007564 -0.005576 -0.012751 -0.006304
2020-11-18 -0.011391 -0.007901 -0.013184 -0.013202
2020-11-19  0.005168  0.003511  0.006348  0.009812
2020-11-20 -0.010958 -0.002048 -0.009557 -0.012319

In [70]:
# compute correlation between two series
returns['MSFT'].corr(returns['AAPL'])

0.7190426322553735

In [71]:
# covariance and different way to address the columns (must be valid Python variable names)
returns.MSFT.cov(returns.IBM)

0.00015978325590303505

In [72]:
# correlation on a Data Frame

In [74]:
returns.corr()

          AAPL       IBM      MSFT      GOOG
AAPL  1.000000  0.479266  0.719043  0.656998
IBM   0.479266  1.000000  0.561662  0.522300
MSFT  0.719043  0.561662  1.000000  0.780551
GOOG  0.656998  0.522300  0.780551  1.000000

In [75]:
# info about the values in a series
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [76]:
uniques = obj.unique()

In [77]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [84]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [85]:
# membership
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [86]:
mask = obj.isin(['b', 'c'])

In [87]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [88]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

### Related to isin is the Index.get_indexer method, which gives you an index array from an array of possibly non-distinct values into another array of distinct values

In [89]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [90]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [91]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [100]:
# how many times does a value appear in a DataFrame?
data = pd.DataFrame({'Quiz1': ['A', 'C', 'D', 'C', 'D'],
                     'Quiz2': ['B', 'C', 'A', 'B', 'C'],
                     'Quiz3': ['A', 'F', 'B', 'D', 'D']})

In [101]:
data

  Quiz1 Quiz2 Quiz3
0     A     B     A
1     C     C     F
2     D     A     B
3     C     B     D
4     D     C     D

In [102]:
result = data.apply(pd.value_counts).fillna(0)

In [103]:
result

   Quiz1  Quiz2  Quiz3
A    1.0    1.0    1.0
B    0.0    2.0    1.0
C    2.0    2.0    0.0
D    2.0    0.0    2.0
F    0.0    0.0    1.0